Mengganti Nama Kolom pada Data Frime

In [3]:
import pandas as pd
import numpy as np

In [4]:
j_baris=5
j_kolom=5
kolom=tuple('ABCDE')

data=pd.DataFrame(np.random.randint(1,10, size=(j_baris, j_kolom)), columns=kolom)

data

   A  B  C  D  E
0  6  7  3  3  4
1  5  9  2  2  9
2  5  1  3  9  8
3  3  1  3  3  6
4  5  1  3  3  7

Nah disini kode yang bakalan kita gunakan untuk mengganti nama kolom pada pada kita ialah 'rename'

In [6]:
data.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  6  7     3  3  4
1  5  9     2  2  9
2  5  1     3  9  8
3  3  1     3  3  6
4  5  1     3  3  7

Selanjutnya adalah cara mengubah banyak kolom sekaligus dengan satu kali , kita akan menggunakan dictionary

In [7]:
data.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     6       7  3     3  4
1     5       9  2     2  9
2     5       1  3     9  8
3     3       1  3     3  6
4     5       1  3     3  7